[{"word": "fatuous", "definitionA": "foolish or inane, especially in an unconscious, complacent manner; silly; witless.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Obnoxiously stupid, vacantly silly, content in one's foolishness.<br>", "etymology": "First recorded in 1625–35; from Latin fatuus “silly, foolish, idiotic”; -ous", "example": "Surely Americans, who are by our own fatuous self-definition fundamentally decent, would never attempt the unthinkable, no matter how angry.", "synonym": null}, {"word": "igneous", "definitionA": "Geology. produced under conditions involving intense heat, as rocks of volcanic origin or rocks crystallized from molten magma.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Pertaining to or having the nature of fire; containing fire; resembling fire.<br>&nbsp;&nbsp;&nbsp;2. Resulting from, or produced by, great heat. With rocks, it could also mean formed from lava or magma.<br>", "etymology": "First recorded in 1655–65; from Latin igneus “fiery, on fire, burning,” equivalent to igni(s) “fire” + -eus -eous. Ignis is the Latin form of the Proto-Indo-European egni-s, ogni-s, one of the Proto-Indo-European words for “fire,” and it is closely related to Slavic ( Polish ) ogień (inflectional stem ogni- ) and to Sanskrit agni- Agni ( def ); fire ( def )", "example": "The samples were of crystalline igneous rock, meaning rock that solidified into crystals from hot lava or magma.", "synonym": "fused"}, {"word": "abominate", "definitionA": "to regard with intense aversion or loathing; abhor.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To feel disgust towards; to loathe or detest thoroughly; to hate in the highest degree, as if with religious dread.<br>&nbsp;&nbsp;&nbsp;2. To dislike strongly.<br>&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Abominable; detested.<br>", "etymology": "First recorded in 1840–50; from Latin abōminātus “loathed,” past participle of abōminārī. See abominable, -ate 1", "example": "He professed both to abominate and despise all mystery, refinement, and intrigue, either in a prince or a minister.", "synonym": "abhor"}, {"word": "intemperance", "definitionA": "excessive or immoderate indulgence in alcoholic beverages.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Lack of moderation or temperance; excess.<br>&nbsp;&nbsp;&nbsp;2. Drunkenness or gluttony.<br>", "etymology": "First recorded in 1400–50; late Middle English word from Latin word intemperantia. See in- 3, temperance", "example": "On the other hand, many men, by their own vice and intemperance, disqualify themselves for conversation.", "synonym": "alcoholism"}, {"word": "inclement", "definitionA": "(of the weather, the elements, etc.) severe, rough, or harsh; stormy.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Stormy, of rough weather<br>&nbsp;&nbsp;&nbsp;2. Merciless, unrelenting.<br>&nbsp;&nbsp;&nbsp;3. Unmercifully severe in temper or action.<br>", "etymology": "1615–25; < Latin inclēment-, equivalent to in- in- 3 + clēment- (stem of clēmēns ) clement", "example": "Many FKT attempts on the country’s “triple crown” of thru-hikes, which also includes the Appalachian Trail and the Continental Divide Trail, end in failure, often due to injury, inclement weather, or sheer exhaustion.", "synonym": null}, {"word": "limpid", "definitionA": "clear, transparent, or pellucid, as water, crystal, or air:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Clear, transparent or bright.<br>", "etymology": "First recorded in 1605–15, limpid is from the Latin word limpidus clear. See lymph, -id 4", "example": "The Maryland artist overlaps limpid hues, echoing Morris Louis’s style if not his technique.", "synonym": null}, {"word": "nebulize", "definitionA": "to reduce to fine spray; atomize.", "definitionB": "&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To convert liquid into a fine spray of aerosols, by using a nebulizer; to atomize<br>&nbsp;&nbsp;&nbsp;2. To treat a patient with medicine applied using a nebulizer<br>", "etymology": "First recorded in 1870–75; nebul(a) + -ize", "example": "A California-based business called Gordon Medical has advertised an in-office nebulized hydrogen peroxide treatment for both preventing and treating the virus.", "synonym": null}, {"word": "confab", "definitionA": "a confabulation; a conversation.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A casual conversation; a chat.<br>&nbsp;&nbsp;&nbsp;2. A fabricated memory believed to be true.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To speak casually with; to chat.<br>&nbsp;&nbsp;&nbsp;2. To confer.<br>&nbsp;&nbsp;&nbsp;3. To fabricate memories in order to fill gaps in one's memory.<br>", "etymology": "First recorded in 1695–1705; by shortening", "example": "On the other hand, Hank Green — half of the pioneering creator duo Vlogbrothers and cofounder of creator confab VidCon — posted a video calling out TikTok for shortchanging creators with its Creator Fund.", "synonym": "chat"}, {"word": "bellyache", "definitionA": "a pain in the abdomen or bowels.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any pain in the belly, stomach, or abdomen.<br>&#60;verb&#62;<br>&nbsp;&nbsp;&nbsp;1. To unnecessarily complain or whine, often about simple matters.<br>", "etymology": "belly + ache;  bellyache def 1 was first recorded in 1545–55, and  bellyache def 2, an Americanism, in 1885–90", "example": "Well Andy Rooney did and nearly gave himself a bellyache over the results.", "synonym": "bemoan"}, {"word": "anemone", "definitionA": "any of various plants belonging to the genus Anemone, of the buttercup family, having petallike sepals and including several wild species with white flowers as well as others cultivated for their showy flowers in a variety of colors.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Any plant of the genus Anemone, of the Ranunculaceae (or buttercup) family, such as the windflower.<br>&nbsp;&nbsp;&nbsp;2. A sea anemone.<br>", "etymology": "1545–55; < Latin < Greek: literally, daughter of the wind, equivalent to ánem ( os ) wind + -ōnē feminine patronymic suffix; -one", "example": "An anemone can jab a predator or nab some lunch in about a hundredth of a second, says Karabulut, also of the Stowers Institute.", "synonym": "coelenterate"}, {"word": "onomatopoeia", "definitionA": "the formation of a word, as cuckoo, meow, honk, or boom, by imitation of a sound made by or associated with its referent.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The property of a word of sounding like what it represents.<br>&nbsp;&nbsp;&nbsp;2. A word that sounds like what it represents, such as \"gurgle\" or \"hiss\".<br>&nbsp;&nbsp;&nbsp;3. The use of language whose sound imitates that which it names.<br>", "etymology": "First recorded in 1570–80; from Late Latin, from Greek onomatopoiía “making of words,” from onomato- (stem of ónoma “name”) + poi- (stem of poieîn “to make”) + -ia -ia; -onym, poet", "example": "Donald, on the other hand, began imitating Gua’s barks and onomatopoeia, which may have been one reason the experiment ended in just six months.", "synonym": "answer"}, {"word": "quinoa", "definitionA": "a tall crop plant, Chenopodium quinoa, of the amaranth family, cultivated mainly in Peru, Bolivia, and Chile for its small, ivory-colored seed, which is used as a food staple.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. A goosefoot (Chenopodium quinoa) native to the Andes and cultivated for its edible seeds.<br>&nbsp;&nbsp;&nbsp;2. The high-protein dried fruits and seeds of this plant, used as a food staple and ground into flour.<br>", "etymology": "First recorded in 1615–25; from Spanish quinoa, quínoa, quinua, from Quechua kínua, kinúwa", "example": "We’re going to give you healthy food like quinoa, which is one of the most nutritional meals people can have.", "synonym": null}, {"word": "rambunctious", "definitionA": "difficult to control or handle; wildly boisterous:", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Boisterous, energetic, noisy, and difficult to control.<br>", "etymology": "An Americanism dating back to 1820–30; origin uncertain", "example": "When it was time for a “rambunctious yet focused” game of “come,” Pluto followed cues with aptitude and enthusiasm.", "synonym": "loud"}, {"word": "confabulation", "definitionA": "the act of confabulating; conversation; discussion:", "definitionB": "No definition found", "etymology": "First recorded in 1490–1500; from Late Latin confabulātiōn- (stem of confābulātiō ) “conversation,” equivalent to confābulāt(us) ( confabulate ) + -iōn- noun suffix; -ion", "example": "This is most apparent in his discussion of the many forms of confabulation.", "synonym": "chat"}, {"word": "mnemonics", "definitionA": "the process or technique of improving or developing the memory.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. Anything (especially something in verbal form) used to help remember something.<br>&nbsp;&nbsp;&nbsp;2. The textual, human-readable form of an assembly language instruction, not including operands.<br>&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. The study of techniques for remembering anything more easily.<br>", "etymology": "First recorded in 1700–10; mnemonic, -ics", "example": "But, if Dumouchels system of mnemonics had been insufficient for themselves, what would it be for him!", "synonym": null}, {"word": "redolent", "definitionA": "having a pleasant odor; fragrant.", "definitionB": "&#60;adjective&#62;<br>&nbsp;&nbsp;&nbsp;1. Fragrant or aromatic; having a sweet scent.<br>&nbsp;&nbsp;&nbsp;2. Having the smell of the article in question.<br>&nbsp;&nbsp;&nbsp;3. Suggestive or reminiscent.<br>", "etymology": "First recorded in 1350–1400; Middle English, from Latin redolent-, stem of redolēns, present participle of redolēre “to emit odor,” equivalent to red- red- ( def ) + ol(ēre) “to smell” (akin to odor ( def ) )\u007f", "example": "The most recent painting, the starkly monochromatic “Fall of Kabul,” channels recent turmoil in Afghanistan into soft gray gestures redolent of smoke.", "synonym": null}, {"word": "constellation", "definitionA": "Astronomy. any of various groups of stars to which definite names have been given, as Ursa Major, Ursa Minor, Boötes, Cancer, Orion.", "definitionB": "&#60;noun&#62;<br>&nbsp;&nbsp;&nbsp;1. An asterism, an arbitrary formation of stars perceived as a figure or pattern, or a division of the sky including it, especially one officially recognised by astronomers.<br>&nbsp;&nbsp;&nbsp;2. An image associated with a group of stars.<br>&nbsp;&nbsp;&nbsp;3. The configuration of planets at a given time (notably of birth), as used for determining a horoscope.<br>&nbsp;&nbsp;&nbsp;4. A wide, seemingly unlimited assortment.<br>&nbsp;&nbsp;&nbsp;5. A fleet of satellites of the same purpose (such as the set of GPS satellites, or Iridium satcom fleet).<br>&nbsp;&nbsp;&nbsp;6. A configuration or grouping.<br>&nbsp;&nbsp;&nbsp;7. A network of connections that exists between people who are in polyamorous relationships, for example between one person, their partner, and that person's partner.<br>", "etymology": "1275–1325; Middle English constellacioun (< Anglo-French ) < Late Latin constellātiōn- (stem of constellātiō ). See constellate, -ion", "example": "The Global Positioning System consists of a constellation of around 30 satellites orbiting 20,000 kilometers above Earth.", "synonym": "afterlife"}]